___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101) #seed allows us to retain the random generated

In [ ]:
pd.DataFrame()

In [4]:
data = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
#5rows, 4 columns

In [5]:
data.head() #top 5 records (rows and columns)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [6]:
data

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [7]:
data.head(10) #show the top 10 records

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [8]:
data.tail(10) #bottom last 5records

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [9]:
data.shape #shape shows the number of rows and columns 5 rows, 4 columns

(5, 4)

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [27]:
data['Y']

A   -1.136645
B   -0.031579
C   -0.755325
D    0.558769
E   -1.133817
Name: Y, dtype: float64

In [28]:
# Pass a list of column names
data[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [29]:
# SQL Syntax (NOT RECOMMENDED!)
data['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

DataFrame Columns are just Series

In [30]:
type(data['W'])

pandas.core.series.Series

**Creating a new column:**

In [31]:
data['Sum of WY'] = data['W'] + data['Y']
data['Sum of XZ'] = data['X'] + data['Z']

In [34]:
data

          W         X         Y         Z  Sum of WY  Sum of XZ
A -0.993263  0.196800 -1.136645  0.000366  -2.129908   0.197166
B  1.025984 -0.156598 -0.031579  0.649826   0.994405   0.493228
C  2.154846 -0.610259 -0.755325 -0.346419   1.399521  -0.956677
D  0.147027 -0.479448  0.558769  1.024810   0.705796   0.545362
E -0.925874  1.862864 -1.133817  0.610478  -2.059691   2.473342

In [35]:
#creating more columns

In [36]:
data.drop('Sum of XZ',axis=1, inplace=True) #axis =1 means in a column, axis=0 means in a row

          W         X         Y         Z  Sum of WY
A -0.993263  0.196800 -1.136645  0.000366  -2.129908
B  1.025984 -0.156598 -0.031579  0.649826   0.994405
C  2.154846 -0.610259 -0.755325 -0.346419   1.399521
D  0.147027 -0.479448  0.558769  1.024810   0.705796
E -0.925874  1.862864 -1.133817  0.610478  -2.059691

In [37]:
data.head()

          W         X         Y         Z  Sum of WY  Sum of XZ
A -0.993263  0.196800 -1.136645  0.000366  -2.129908   0.197166
B  1.025984 -0.156598 -0.031579  0.649826   0.994405   0.493228
C  2.154846 -0.610259 -0.755325 -0.346419   1.399521  -0.956677
D  0.147027 -0.479448  0.558769  1.024810   0.705796   0.545362
E -0.925874  1.862864 -1.133817  0.610478  -2.059691   2.473342

** Removing Columns**

In [13]:
data.drop(['Sum of XZ', 'sfrhwsder'],axis=1)

          W         X         Y         Z  Sum of WY
A  2.706850  0.628133  0.907969  0.503826   3.614819
B  0.651118 -0.319318 -0.848077  0.605965  -0.196959
C -2.018168  0.740122  0.528813 -0.589001  -1.489355
D  0.188695 -0.758872 -0.933237  0.955057  -0.744542
E  0.190794  1.978757  2.605967  0.683509   2.796762

In [14]:
# Not inplace unless specified!
df

          W         X         Y         Z  Sum of WY  Sum of XZ
A  2.706850  0.628133  0.907969  0.503826   3.614819   1.131958
B  0.651118 -0.319318 -0.848077  0.605965  -0.196959   0.286647
C -2.018168  0.740122  0.528813 -0.589001  -1.489355   0.151122
D  0.188695 -0.758872 -0.933237  0.955057  -0.744542   0.196184
E  0.190794  1.978757  2.605967  0.683509   2.796762   2.662266

** Selecting Rows**

In [38]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [39]:
df.loc['E']

W   -0.116773
X    1.901755
Y    0.238127
Z    1.996652
Name: E, dtype: float64

Or select based off of position instead of label

In [40]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [18]:
df

          W         X         Y         Z  Sum of WY  Sum of XZ
A  2.706850  0.628133  0.907969  0.503826   3.614819   1.131958
B  0.651118 -0.319318 -0.848077  0.605965  -0.196959   0.286647
C -2.018168  0.740122  0.528813 -0.589001  -1.489355   0.151122
D  0.188695 -0.758872 -0.933237  0.955057  -0.744542   0.196184
E  0.190794  1.978757  2.605967  0.683509   2.796762   2.662266

In [41]:
df.loc['B','Y']

0.16690463609281317

In [42]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [43]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [44]:
df[df<0]

          W        X         Y         Z
A       NaN      NaN -1.706086 -1.159119
B -0.134841      NaN       NaN       NaN
C       NaN      NaN       NaN       NaN
D -0.497104 -0.75407 -0.943406       NaN
E -0.116773      NaN       NaN       NaN

In [45]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [46]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [47]:
df[df['W']>0]['W']

A    0.302665
C    0.807706
Name: W, dtype: float64

In [48]:
df[df>0][['Y','X']]

          Y         X
A       NaN  1.693723
B  0.166905  0.390528
C  0.638787  0.072960
D       NaN       NaN
E  0.238127  1.901755

For two conditions you can use | and & with parenthesis:

In [49]:
df[(df>0) & (df['Y'] > 1)]

    W   X   Y   Z
A NaN NaN NaN NaN
B NaN NaN NaN NaN
C NaN NaN NaN NaN
D NaN NaN NaN NaN
E NaN NaN NaN NaN

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [57]:
data

          W         X         Y         Z  Sum of WY  Sum of XZ
A -0.993263  0.196800 -1.136645  0.000366  -2.129908   0.197166
B  1.025984 -0.156598 -0.031579  0.649826   0.994405   0.493228
C  2.154846 -0.610259 -0.755325 -0.346419   1.399521  -0.956677
D  0.147027 -0.479448  0.558769  1.024810   0.705796   0.545362
E -0.925874  1.862864 -1.133817  0.610478  -2.059691   2.473342

In [58]:
# Reset to default 0,1...n index
data.reset_index(inplace=True)  #reset the value or the index to default

In [59]:
data

  index         W         X         Y         Z  Sum of WY  Sum of XZ
0     A -0.993263  0.196800 -1.136645  0.000366  -2.129908   0.197166
1     B  1.025984 -0.156598 -0.031579  0.649826   0.994405   0.493228
2     C  2.154846 -0.610259 -0.755325 -0.346419   1.399521  -0.956677
3     D  0.147027 -0.479448  0.558769  1.024810   0.705796   0.545362
4     E -0.925874  1.862864 -1.133817  0.610478  -2.059691   2.473342

In [61]:
data.drop('index', axis=1, inplace=True)

In [55]:
df.drop(['level_0','index'], axis=1, inplace=True)

In [56]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [33]:
newind = 'CA NY WY OR CO'.split()

#newind = ['s', 'd']

In [34]:
df['States'] = newind

In [35]:
df

          W         X         Y         Z  Sum of WY  Sum of XZ States
0  2.706850  0.628133  0.907969  0.503826   3.614819   1.131958     CA
1  0.651118 -0.319318 -0.848077  0.605965  -0.196959   0.286647     NY
2 -2.018168  0.740122  0.528813 -0.589001  -1.489355   0.151122     WY
3  0.188695 -0.758872 -0.933237  0.955057  -0.744542   0.196184     OR
4  0.190794  1.978757  2.605967  0.683509   2.796762   2.662266     CO

In [8]:
df.set_index('States', inplace=True)

In [35]:
df.columns

Index(['index', 'W', 'X', 'Y', 'Z', 'Sum of WY', 'Sum of XZ', 'States'], dtype='object')

In [9]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   W          5 non-null      float64
 1   X          5 non-null      float64
 2   Y          5 non-null      float64
 3   Z          5 non-null      float64
 4   Sum of WY  5 non-null      float64
 5   Sum of XZ  5 non-null      float64
 6   States     5 non-null      object
dtypes: float64(6), object(1)
memory usage: 408.0+ bytes

In [38]:
df.shape

(5, 7)

In [39]:
df.isnull().sum()

W            0
X            0
Y            0
Z            0
Sum of WY    0
Sum of XZ    0
States       0
dtype: int64

In [40]:
df

          W         X         Y         Z  Sum of WY  Sum of XZ States
0  2.706850  0.628133  0.907969  0.503826   3.614819   1.131958     CA
1  0.651118 -0.319318 -0.848077  0.605965  -0.196959   0.286647     NY
2 -2.018168  0.740122  0.528813 -0.589001  -1.489355   0.151122     WY
3  0.188695 -0.758872 -0.933237  0.955057  -0.744542   0.196184     OR
4  0.190794  1.978757  2.605967  0.683509   2.796762   2.662266     CO

In [41]:
df.set_index('States',inplace=True)

In [43]:
df.reset_index(inplace = True)

In [44]:
df

  States         W         X         Y         Z  Sum of WY  Sum of XZ
0     CA  2.706850  0.628133  0.907969  0.503826   3.614819   1.131958
1     NY  0.651118 -0.319318 -0.848077  0.605965  -0.196959   0.286647
2     WY -2.018168  0.740122  0.528813 -0.589001  -1.489355   0.151122
3     OR  0.188695 -0.758872 -0.933237  0.955057  -0.744542   0.196184
4     CO  0.190794  1.978757  2.605967  0.683509   2.796762   2.662266

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [45]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [46]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [48]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [49]:
df.loc['G1']

          A         B
1  0.147027 -0.479448
2  0.558769  1.024810
3 -0.925874  1.862864

In [50]:
df.loc['G1'].loc[1]

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [51]:
df.index.names

FrozenList([None, None])

In [52]:
df.index.names = ['Group','Num']

In [53]:
df

                  A         B
Group Num
G1    1    0.147027 -0.479448
      2    0.558769  1.024810
      3   -0.925874  1.862864
G2    1   -1.133817  0.610478
      2    0.386030  2.084019
      3   -0.376519  0.230336

In [54]:
df.xs('G1')

            A         B
Num
1    0.147027 -0.479448
2    0.558769  1.024810
3   -0.925874  1.862864

In [55]:
df.xs(['G1',1])

A    0.147027
B   -0.479448
Name: (G1, 1), dtype: float64

In [56]:
df.xs(1,level='Num')

              A         B
Group
G1     0.147027 -0.479448
G2    -1.133817  0.610478

# Great Job!